# Аз ≤ Азф = 1,18 (Ky,i × Kn,i) × Kp × KN / (Ky,i + Kn,i)

# Аз ≤ Азф = 1,18 (Ky,i × Kn,i) × (Kзаб / Кбуд) × KN / (Ky,i + Kn,i)
# Kp = Kзаб / Кбуд
# KN = Min KN з таблиці шарів (напевно в бд шарів зберігати КИ і потім находити мін)
# Аз=А.1; Ку,Кп=Г.1; Кзаб=Г.2; Кбуд=Г.3; KN=Г.4

#АIV (1000)      (a4- самий слабий захист??)
#бетон, 10 см, (вологість 2)
#житлова, забор з бетону
#висота 8-10, щільність 10%, товщина забору 20 см, площа отворів 10%

Az=1000
Ky=2
Kn=6.2

Kzab=1.0
Kbud=0.50

KN=1.4

Azf=1.18*(Ky*Kn)*(Kzab/Kbud)*KN/(Ky+Kn)
print("Az: ",Az)
print (Azf," = 1.18 * ", "( ",Ky," * ",Kn,") * (",Kzab," / ",Kbud,") * ",KN," / (",Ky," + ",Kn,")")
print("Azf: ",Azf)
print("Az<=Azf",Az<=Azf)